Repository: linux-ha-japan/doc-ja
Catalog: pacemaker-1.0-crm-cli/tm/pacemaker-1.0-crm-cli-level2.tmx
Source language: en_us
Languages: ja

source: From the user's point of view, the status section is essentially a read-only part of the CIB.
ja: このため、cibstatusセクションは基本的に読み込み専用領域となります。

source: Shadow CIBs may be manipulated in the same way like the _live_ CIB, but these changes have no effect on the cluster resources.
ja: シャドウCIBはライブCIBと同様の操作が可能ですが、シャドウCIBに対する設定変更はクラスタには反映されません。

source: Additionally, you may specify a lifetime for the standby---if set to `reboot`, the node will be back online once it reboots.
ja: lifetimeオプションにrebootを指定した場合、スタンバイ状態のノードが再起動した後、ノードはオンライン状態でクラスタに参加します。

source: Nodes in the CIB are commonly created automatically by the CRM. Hence, you should not need to deal with nodes unless you also want to define node attributes.
ja: ノードの情報はCRMによって自動的に生成されます。ノードの属性値を編集する場合を除いて、このコマンドでなにか操作を実行する必要はあまりありません。

source: Since attribute sets' ids, though they do exist, are not shown in the `crm`, it is also possible to reference an object instead of an attribute set.
ja: $id-refには、参照元のリソースの$idを設定します。

source: Additionally, you may specify a lifetime for the constraint---once it expires, the location constraint will no longer be active.
ja: つまり、リソースが現行ノードで起動不可となる制約が追加されるため、リソースは他ノードへ移動することになります。制約にはlifetimeオプションを追加することも可能です。lifetimeが失効すると、現行ノードに追加された制約は無効となります。

source: All `ERROR` messages show the line numbers in which the respective parameters are to be defined: ...............
ja: エラーメッセージの表示されたパラメータには、ユーザが値を入力する必要があります。 ...............

source: Cleanup resource status.
ja: cleanupコマンドはリソースの故障履歴(フェイルカウントを含む)を削除します。

source: Load a part of configuration (or all of it) from a local file or a network URL.
ja: loadコマンドはローカルまたはネットワーク上のファイルを読み込みます。

source: Make CRM fence a node.
ja: fenceコマンドはノードをフェンス(停止)します。

source: These lines are the only ones that should be modified.
ja: 上記のパラメータはユーザの環境にあわせて変更する必要があります。

source: `ptest` can also show allocation scores.
ja: リソースに割り当てられたスコアを表示することもできます。

source: Usage: ...............
ja: 使用方法: ...............

source: Monitor is by far the most common operation.
ja: monitorは最も一般的なオペレーションです。

source: No changes take place before the `configure commit` command.
ja: `configure commit`コマンドを実行してはじめて、シャドウCIBの変更がクラスタ(ライブCIB)に反映されます。

source: Cluster configuration:
ja: バッチ入力モード

source: If the user insists, he or she may edit the XML edition of the object.
ja: XML形式で編集することも可能ですが

source: User may tune the frequency of checks and the treatment of errors by the <<cmdhelp_options_check-frequency,`check-frequency`>> and <<cmdhelp_options_check-mode,`check-mode`>> preferences.
ja: 構文チェックが実行される頻度は<<cmdhelp_options_check-frequency,`check-frequency`>>と <<cmdhelp_options_check-mode,`check-mode`>>で定義されています。

source: If the argument is omitted, the status is saved to wherever the status section originated.
ja: 引数が省略された場合は、statusセクションの変更はオリジナルのCIBに保存されます。

source: Apart from nodes.
ja: ただしノード情報の削除対象外です。

source: Currently, all meta attributes of a resource may be managed with other commands such as `resource stop`.
ja: 現在、全てのリソースのmeta属性は、metaコマンド以外、例えば resource stop などでも操作可能となっています。

source: Even though we promissed no xml, it may happen, but hopefully very very seldom, that an element from the CIB cannot be rendered in the configuration language.
ja: CRM-CLIはXMLを編集しないことを前提としていますが、CIBの内容が複雑になると、まれにXMLを直接編集しなければならない場合があります。

source: Rename an object.
ja: `rename`コマンドはオブジェクトの名前を変更します。

source: The status section may be loaded from another source and modified using the <<cmdhelp_cibstatus,`cibstatus`>> level commands.
ja: クラスタの情報を保持しているstatusセクションは <<cmdhelp_cibstatus,`cibstatus`>> レベルのコマンドで操作することができます。

source: The `edit` command invokes the preferred text editor with the `web` configuration.
ja: `edit`コマンドを実行するとテキストエディタが起動します。エディタを使用して先ほどの設定(設定名 web)を手動で編集しましょう。

source: The `show` command displays objects.
ja: `show`コマンドは設定された値を表示します。

source: `forever` will keep the node in standby after reboot.
ja: lifetimeオプションにforeverを指定した場合、スタンバイ状態のノードが再起動した後、ノードはスタンバイ状態でクラスタに参加します。

source: Use `normal` if you want to keep the default foreground color.
ja: デフォルトの表示を使用する場合は、normalを指定します。

source: Also, long primitive definitions may be a bit uncluttered.
ja: primitiveリソースは単純なリソースですが、様々な設定を追加していくと複雑になってしまう場合があります。

source: Shadow CIB is a new feature.
ja: シャドウCIBは新しく追加された機能です。

source: Show/edit/delete the failcount of a resource.
ja: failcountコマンドはリソースのフェイルカウントを表示、編集、削除します。

source: Though operation timeouts issues are treated as warnings, make sure that the timeouts are usable in your environment.
ja: オペレーションに設定されたタイムアウト値が小さいと、クラスタはリソースの起動時に警告(warning)を出力します。警告が出力された場合はタイムアウト値を再検討してください。

source: Operation's attributes which are not recognized are saved as instance attributes of that operation.
ja: オペレーションの属性は、instance attributesとして保持されます。

source: Add a string of `v` characters to increase verbosity.
ja: -vオプションでデバッグレベルを変更することもできます。

source: The usage is, however, plagued by the notorious weakness common to all UNIX tools: a multitude of options, necessary for operation and yet very hard to remember.
ja: しかし、コマンドラインツールはオプションの種類が多く操作も複雑であるため、習熟に時間がかかるという欠点があります。

source: It is also possible to work with the so-called shadow CIBs, i.e. configurations which are stored in files and aren't active, but may be applied at any time to the cluster.
ja: ライブCIBではなくシャドウCIBに対して操作を実行することもできます。シャドウCIBとはライブCIBのコピーと考えてよいでしょう。シャドウCIBに対する操作はライブCIBには反映されません。

source: As noted elsewhere, commands in a configure session don't have immediate effect on the CIB.
ja: configureレベルで実行したコマンドはCIBに即座に反映されるわけではありません。

source: Edit the outcome of a resource operation.
ja: opコマンドを使用してリソースのオペレーションに設定された名前などを編集することができます。

source: The checks require that resource agents are present.
ja: 構文チェックを実行するためにはリソースエージェントが指定のディレクトリに配置されている必要があります。

source: Use this to specify your preferred pager program.
ja: 好みのページャプログラムを指定することもできます。

source: Add `changed` option to get a human readable output of all changes.
ja: changeオプションを使用すると、いくぶんかは読みやすい出力になるかもしれません。

source: Show PE (Policy Engine) motions using `ptest(8)`.
ja: `ptest`コマンドを実行してPE(Policy Engine)の遷移グラフを表示します。

source: == Design goals
ja: == CRM-CLIの開発目標

source: These attributes are managed by the following commands:
ja: 属性の設定に使用するコマンドは次の通りです。

source: Use the `list` command to show templates available on the system.
ja: `list templates`コマンドを実行すると、利用可能なテンプレートの一覧が表示されます。

source: The `update` tries to import the contents into the current configuration.
ja: `update`オプションを使用した場合、現在の設定は上書きされます。

source: Node management and status commands.
ja: nodeコマンドはノードの管理を行います。

source: Experts may want to change the setting to `on-verify`.
ja: クラスタの管理に慣れた上級者の場合はon-verifyを設定してもよいでしょう。この場合、verifyコマンドが実行されたタイミングで構文がチェックされます。

source: Note that configurations and templates are kept in different places, so it is possible to have a configuration name equal a template name.
ja: configurationレベルとtemplateレベルの設定内容は別々に保存されます。それぞれのレベルで同じ名前のテンプレートを作成することもできます。

source: The location constraints consist of one or more rules which specify a score to be awarded if the rule matches.
ja: 配置制約は、1つ以上のruleから構成されており、ruleに適合したリソースに対して特定のスコアが割り当てられます。

source: Note that if the `check-frequency` is set to `always` and the `check-mode` to `strict`, errors are not tolerated and such configuration cannot be saved.
ja: `check-frequency`が`always`に設定されており、かつ`check-mode`が`strict`に設定されている場合、エラーは決して許容されないため、エラーを含む設定内容はクラスタに反映されません。

source: This kind of attribute should refer to relatively static properties, such as memory size.
ja: ノードに必要なメモリサイズなどを属性値として設定することができます。

source: Otherwise, there is no need to use `xml` for configuration.
ja: ただし、xmlコマンドを使用することはほとんどないはずです。

source: Commit the current configuration to the CIB in use.
ja: commitコマンドは変更内容をCIBに反映します。

source: == Reference
ja: == コマンドリファレンス

source: If you want to edit the status from the shadow CIB specify `withstatus` (see <<cmdhelp_cibstatus,`cibstatus`>>).
ja: シャドウCIBのstatusセクションを編集する場合は、`withstatus`を指定してください。詳細は<<cmdhelp_cibstatus,cibstatus section>>を参照してください。

source: `location` defines the preference of nodes for the given resource.
ja: locationはリソースの配置制約を定義します。

source: Therefore, the `ptest` command by default uses the running cluster status section.
ja: よって、ptestコマンドはデフォルトでライブCIBのstatusセクションを参照します。

source: If the resource parameter is left out status of all resources is printed.
ja: 引数が省略された場合、すべてのリソースの状態が表示されます。

source: After editing the file, use `show` again to display the configuration: ...............
ja: `edit`コマンドで設定を編集した後、`show`コマンドで設定内容を確認してください。 ...............

source: The shell will look up files in the local directory first and then in the PE directory (typically `/var/lib/pengine`).
ja: importコマンドは、まずプログラムが実行されたローカルファイルを参照した後、/var/lib/pengineを検索します。ファイルのフルパスを指定することも可能です。

source: At times it may be useful to create a shadow file from the existing CIB.
ja: importコマンドはファイルに保存されたCIBの情報をシャドウCIBに取り込みます。

source: If you get the `CIB not supported` error, which typically means that the current CIB version is coming from the older release, you may try to upgrade it to the latest revision.
ja: `CIB not supported`というエラーが出力された場合は、CIBのバージョンが古い可能性があります。updateコマンドを実行してCIBのバージョンを更新してください。

source: Create a new configuration from one or more templates.
ja: newコマンドは新しいテンプレートを作成します。テンプレートは同時に複数作成することもできます。

source: `crm` will automatically replace such a reference with the right id:
ja: 参照元のリソースが存在している場合、CRM-CLIが自動的に参照値を挿入します。

source: Based on the skill-level setting, the user is allowed to use only a subset of commands.
ja: skill-levelコマンドを使用して、各ユーザが実行可能な操作を制限することができます。

source: For instance, after editing this template, the result could look like this (we used tabs instead of spaces to make the values stand out): ...............
ja: 編集しおわった設定を再度検索すると、下記の様な表示が得られるでしょう。netmask, lvs_support, opsions, envfiles は必須パラメータではないので、空欄でもかまいません。 ...............

source: The operator level allows only commands at the `resource` and `node` levels, but not editing or deleting resources.
ja: operatorはresourceおよびnodeコマンドを使用することができますが、リソースの編集や削除は実行できません。

source: In case the CIB in use changed in the meantime, presumably by somebody else, the CLI will refuse to apply the changes.
ja: 複数のユーザが同時に編集を行っている場合は、設定内容の反映が拒否されることもあります。

source: For some it is going to be (or remain) the first choice in cluster management.
ja: 初めてクラスタを管理する場合はまずGUIを試してみるとよいでしょう。

source: If the class is `ocf`, supply a provider to get agents which are available only from that provider.
ja: classパラメータに`ocf`を指定した場合、利用可能なOCF RAを表示します。

source: On further `crm` runs, the rc file is automatically read and parsed.
ja: CRM-CLIの実行時に、rcファイルが自動的に読み込まれます。

source: Otherwise, the current user edited configuration is saved along with the status section.
ja: CIBのフォーマットで記述されたファイルが存在しない場合h、statusセクションだけではなくすべての設定が保存さます。

source: If you know that it's fine to still apply them add `force`.
ja: このような場合あh、`force`オプションを追加して強制的に変更を反映することもできます。

source: If it's not referenced, then it is placed as a single resource in the CIB.
ja: 他のリソースから参照されていないprimitiveリソースは単純な一つのリソースとして起動します。

source: Set defaults for the operations meta attributes.
ja: op_defaultsコマンドはオペレーションに設定するmeta属性のデフォルト値を定義します。

source: The expert may do all.
ja: expertはすべての操作を実行することができます。

source: It is probably best just to give some examples:
ja: では、いくつかの例を紹介しましょう。

source: This is where users can find information on how to use a resource agent.
ja: meta-dataにはリソースエージェントの使用方法などが記述されています。

source: Ordered resource sets have an extra attribute to allow for sets of resources whose actions may run in parallel.
ja: 順序居制約には依存関係の優先度を設定することができます。

source: The syntax is described in a somewhat informal manner: `<>` denotes a string, `[]` means that the construct is optional, the ellipsis (`...`) signifies that the previous construct may be repeated, `|` means pick one of many, and the rest are literals (strings, `:`, `=`).
ja: コマンドの構文例: `<>` 文字列を表します。 `[]` 省略可能であることを意味します。 (`...`) 繰り返しを意味します。 `|` 多数の項目からある一項目を選択します。 (strings, `:`, `=`) その他の構文要素です。

source: If the file exists and contains a complete CIB, only the status section is going to be replaced and the rest of the CIB will remain intact.
ja: CIBのフォーマットで記述されたファイルが既に存在する場合は、statusセクションの変更内容のみが置換されます、。

source: The only complex constructs are found at the `configure` level.
ja: `configure`レベルで使用するコマンドに関しては複雑なオプションもいくつか存在しますが、その他のコマンドは総じて直感的に操作することができるでしょう。

source: Change the node status.
ja: nodeコマンドはノードの状態を変更します。

source: Note that after executing the command, the monitor operation may be shown as part of the primitive definition.
ja: 上記の例では、primitiveリソースにmonitorオペレーションのinterval(60分)とtimeout(60秒)を設定しています。intervalはmonitorオペレーションが実行される「間隔」、timeoutはmonitorオペレーションが失敗した場合に故障を検知する「タイムアウト(待ち時間)」です。

source: Load a status section from a file, a shadow CIB, or the running cluster.
ja: loadコマンドはファイルやシャドウCIB、ライブCIBからstatusセクションを読み込みます。

source: Or should I say drill.
ja: 何度も操作を試してみて慣れていくしかありませんが、

source: Templates are ready made configurations created by cluster experts.
ja: CRM-CLIには、クラスタを設定するための基本的なテンプレートがいくつが用意されています。

source: A CIB is constructed using the current user edited configuration and the status from the running CIB.
ja: CIBには、ユーザが編集した情報だけではなく、実行中のクラスタ状態が保持されています。

source: - `location` - `colocation` - `order`
ja: - `location` (配置制約) - `colocation` (同居制約) - `order` (順序制約)

source: The CLI will not try to update the objects it does not understand.
ja: CRM-CLIによる操作が失敗した場合、操作内容はCIBには反映されません。

source: Any related constraints are removed as well.
ja: また、削除するオブジェクトに依存関係のある制約も全て削除されます。

source: The GUI is very popular and it has recently seen a lot of good development.
ja: GUIは特に人気のあるツールで、現在も改良が続けられています。(訳者注：2012年1月時点において三種類のGUIが提供されています。Python GUI, LCMC, Hawk)

source: Note that there are often more than one PE input file, so you may need to specify the full name.
ja: PEファイルは複数出力されていることが多いので、ファイル名をしている際は注意してください。

source: The CRM (a.k.a Pacemaker) is a Cluster Resource Manager which implements the cluster configuration provided by the user in CIB (Cluster Information Base).
ja: CRM(Cluster Resource Manager, 別名 Pacemaker)はクラスタマネージャです。CRMはCIB(Cluster Information Base)に保存された情報をもとにクラスタを管理します。

source: (This also allows a shadow CIB to be created in case no cluster is running.)
ja: シャドウCIBはライブCIBが存在していない状態、つまりクラスタが起動していない状態でも作成することができます。

source: Unmanage a resource using the `is-managed` attribute.
ja: unmanageコマンドはリソースを管理対象外とします。

source: Print resource status.
ja: statusコマンドはリソースの状態を表示します。

source: A more secure way is to run the program with your usual privileges, set this option to the appropriate user (such as `hacluster`), and setup the `sudoers` file.
ja: rootユーザ以外のユーザでCRM-CLIを操作する場合は、userコマンドを使用して適切なユーザに切り替えてください。

source: Save current settings to the rc file (`$HOME/.crm.rc`).
ja: saveコマンドはCRM-CLIの設定内容を保存します。保存先は`$HOME/.crm.rc`です。

source: You can use tab completion to pick templates.
ja: タブキーによる入力補完も使用することができます。

source: Show/edit/delete a parameter of a resource.
ja: paramコマンドはリソースのパラメータを表示、編集、削除します。

source: Verify the contents of the CIB which would be committed.
ja: verifyコマンドを使用して変更内容を検証することができます。

source: Delete an existing shadow CIB.
ja: deleteコマンドはシャドウCIBを削除します。

source: The `crm` makes extensive use of the tab completion of `readline`.
ja: CRM-CLIはタブキーによる入力補完が可能です。

source: Create a new shadow CIB.
ja: newコマンドは新しいシャドウCIBを作成します。

source: In that case, the `ptest` command will issue a message informing the user that the Policy Engine graph is not calculated based on the current status section and therefore won't show what would happen to the running but some imaginary cluster.
ja: `ptest`コマンドは実際のクラスタ状態を変化させずに、擬似的な遷移グラフを作成します。

source: Sufficient privileges are necessary in order to manage a cluster: programs such as `crm_verify` or `crm_resource` and, ultimately, `cibadmin` have to be run either as `root` or as the CRM owner user (typically `hacluster`).
ja: CRM-CLIは`crm_verify`, `crm_resource`, `cibadmin` などのコマンドラインツールを呼び出しているため、rootユーザやCRMのオーナ(通常はhaclusterユーザ)の権限が必要となる場合があります。

source: This command is available everywhere.
ja: このコマンドはどのレベルでも利用可能です。

source: Save the configuration of the current level to a file.
ja: saveコマンドは設定内容をファイルに保存します。

source: This user preference defaults to `yellow,normal,cyan,red,green,magenta` which is good for terminals with dark background.
ja: デフォルト値はyellow, normal, cyan, red, green, magentaです。ターミナルの背景を黒っぽい色にしておくと見やすいでしょう。

source: Interactive use:
ja: 対話式モード

source: Edit node attributes.
ja: attributeコマンドはノードの属性を編集します。

source: All are just a set of attributes.
ja: クラスタプロパティ、リソースのメタ属性、オペレーションのデフォルト値は属性値として処理されます。

source: In that case, the element will be shown as raw xml, prefixed by this command.
ja: このような場合はxmlコマンドを使用してください。

source: If reusing operation sets is desired, use the "operations" keyword along with the id to give the operations set a name and the id-ref to reference another set of operations.
ja: オペレーションの定義を他のリソースから参照可能な状態とするためには、operationsキーワードを追加し、$id-refパラメータにユニークなIDを設定してください。他のリソースは$id-refの値を参照します。

source: Note that, for obvious reasons, only commands at the `configure` level make sense while working with a shadow CIB.
ja: シャドウCIBでは、`configure`レベルのコマンドのみ使用可能です。

source: See the <<cmdhelp_cibstatus,CIB status management section>>.
ja: 詳細は<<cmdhelp_cibstatus,CIB status management section>>を参照してください。

source: Show a node definition.
ja: showコマンドはノードの設定内容を表示します。

source: The node parameter defaults to the node where the command is run.
ja: ノードを指定する引数が省略された場合、コマンドを実行したノードがオンライン化されます。

source: It should also allow deployment of raw XML which may come either from files or network.
ja: XML形式の設定を直接編集し、ファイルまたはネットワーク経由でクラスタへ反映することも可能です。

source: If you do that, don't modify any id attributes.
ja: リソースや制約に設定されたIDを変更しないように注意してください。

source: Changing ids with the edit command won't have the same effect.
ja: edirコマンドでリソースの名前を変更した場合は、制約の設定が変更されないため、設定内容に矛盾が生じる可能性があります。

source: This can cause data corruption if you confirm that a node is down that is, in fact, not cleanly down - the cluster will proceed as if the fence had succeeded, possibly starting resources multiple times.
ja: clearnodestateコマンドを実行してもリソースは起動したままとなる場合があります。このとき共有ディスクの二重マウントなどを引き起こす可能性もあるので注意してください。

source: With this option set to `yes` it will wait for the started transition to finish.
ja: waitをyesに設定すると、コマンドの実行結果を待ってからプロンプトを復帰させます。

source: Note that removing nodes from the live cluster may have some strange/interesting/unwelcome effects.
ja: 実行中のクラスタからノードの情報を削除すると、予想外の動作が発生する可能性があるので十分に注意してください。

source: Show the meta-data of a resource agent type.
ja: metaコマンドはリソースエージェントのmeta-dataを表示します。

source: The CIB is a set of instructions coded in XML.
ja: CIBはXML形式で記述されています。

source: This functionality depends on stonith resources capable of fencing the specified node.
ja: STONITHリソースが利用可能な場合にのみ実行されます。

source: If the resource is a group or a clone, all `is-managed` attributes are removed from the children resources.
ja: リソースがgroupリソース、またはcloneリソースの場合、子リソースから`target-role`属性が削除されます。

source: The administrator may do that and may also configure the cluster at the `configure` level and manage the shadow CIBs.
ja: administratorは、operatorの権限に加えて、configureコマンドによるクラスタの設定、およびシャドウCIBの管理を実行することができます。

source: `offline`:: Set the `node_state` `crmd` attribute to `offline` and the `expected` attribute to empty.
ja: `offline`:: node_state, crmdの属性をofflineへ変更します。また、expextedの属性を削除します。

source: The command line tools, lead by `crm_resource(8)`, are capable of performing almost any kind of CIB transformation.
ja: Pacemakerには`crm_resource`コマンドをはじめとするコマンドラインツールが付属しており、これらを利用してCIBを編集することもできます。

source: Obviously, this status section doesn't have much to do with the running cluster status, unless the shadow CIB has just been created.
ja: よってライブCIBとは異なるstatus情報を保持している可能性があります。

source: The CLI has to be run on one of the cluster nodes.
ja: CRM-CLIはクラスタ内のノードで実行してください。

source: With `output` set to `color`, a comma separated list of colors from this option are used to emphasize:
ja: outputoにcolorを設定します。カンマ区切り形式で複数のcolorを指定することもできます。下記の情報を出力した際に文字が色分けされます。

source: The live cluster configuration and status is copied to the shadow CIB.
ja: newコマンドを実行するとライブCIBがシャドウCIBにコピーされます。

source: If not set, it will default to either the value of the `PAGER` environment variable or to one of the standard UNIX system pagers (`less`,`more`,`pg`).
ja: 特定のページャが設定されていない場合は、環境変数EDITORもしくは標準UNIXエディタ(less, more, pg)がデフォルトで設定されます。

source: Process the current or given configuration and display the result.
ja: showコマンドはテンプレートの内容を表示します。

source: The `replace` method replaces the current configuration with the one from the source.
ja: `replace`オプションを使用した場合、現在の設定を削除して新しい設定を読み込みます。

source: Optionally, as XML.
ja: XML形式で保存することも可能です。

source: If we don't recognize the current CIB as the old one, but you're sure that it is, you may force the command.
ja: エラーが出力されない場合でも、CIBのバージョンが古いということがわかっているのであれば、forceオプションを使用して強制的にバージョンアップしてください。

source: That's by far the most common way to define operations.
ja: 一般的なリソースには、いくつかのオペレーションが定義されます。

source: Set defaults for the resource meta attributes.
ja: rsc_defaultsコマンドはリソースに設定するmeta属性のデフォルト値を定義します。

source: The class parameter defaults to `ocf`.
ja: デフォルトのclassは`ocf`です。

source: Display all current settings.
ja: showコマンドはCRM-CLIの設定内容を表示します。

source: The user prompt always includes the name of the currently active shadow or the live CIB.
ja: CRM-CLIを実行中、プロンプトにはシャドウCIBもしくはライブCIBの名前が表示されます。

source: A file containing a set of CLI instructions may be applied to the CLI tool to generate a complete CIB.
ja: CRM-CLIのコマンドを記述したスクリプトはXML形式ではありませんが、CIBに反映することが可能です。

source: There are several levels and entering each of them enables the user to use a certain set of commands.
ja: CRM-CLIは、XMLの階層ごとに特定のコマンドを使用します。

source: Since the CIB is hierarchical such is the interface too.
ja: CIBはXMLの階層構造を保持しており、

source: .Note ************************** I do understand that there are people capable of dealing with XML without an intermediary.
ja: .備考 ************************** XMLの扱いに慣れたユーザであれば、CIBの編集はそれほど難しくないかもしれませんが、クラスタの構成が複雑になればなるほどCIBも複雑になります。

source: It is possible to throw a node out of the cluster, make it a member, or set its state to unclean.
ja: ノードをクラスタから除外したり、新しいノードをクラスタへ参加させたりするだけではなく、クラスタに参加しているノードの状態をuncleanへ変更することもできます。

source: Specify `withstatus` if you want to edit the status section of the shadow CIB (see the <<cmdhelp_cibstatus,cibstatus section>>).
ja: シャドウCIBのstatusセクションを編集する場合は、`withstatus`を指定してください。詳細は<<cmdhelp_cibstatus,cibstatus section>>を参照してください。

source: It is recommended to use this command to rename a resource, because it will take care of updating all related constraints and a parent resource.
ja: リソースの名前を変更したい場合は、このコマンドを使用してください。renameコマンドを使用すると依存関係にある制約も一括して変更されます。

source: All CIB shadow configurations contain the status section which is a snapshot of the status section taken at the time the shadow was created.
ja: シャドウCIBも、statusセクションを保持していますが、この情報はシャドウCIBが作成されたときのものです。

source: This level is for management of shadow CIBs.
ja: cibコマンドはシャドウCIBの管理を行います。

source: Note that this still does not commit the configuration to the CIB which is used in the shell, either the running one (`live`) or some shadow CIB.
ja: ここで中止しなくてはならないのは、`apply`コマンドを実行した時点では、まだクラスタに設定が反映されていないということです。これはライブCIBを直接編集する場合だけではなくシャドウCIBを操作する場合も同じです。

source: Demote a master-slave resource using the `target-role` attribute.
ja: demoteコマンドはリソースをマスター状態からスレーブ状態へデモート(降格)します。

source: The `new` command creates a configuration from the `apache` template.
ja: `new`コマンドを実行して、Apacheの設定を作成します。

source: In order to make this command as concise as possible, less common operation attributes are not available.
ja: monitorコマンドは、あくまで単純にmonitorオペレーションを追加することを目的としています。

source: It is advisable to give meaningful names to attribute sets which are going to be referenced.
ja: id-refで参照されることを考慮して、リソースの属性値にはわかりやすいIDを設定することをお勧めします。

source: If a node is omitted, cleanup on all nodes.
ja: ノードを指定する引数を省略した場合、すべてのノードで故障履歴の削除が実行されます。
